In [1]:
import numpy as np
# Task1
data1 = np.random.randint(3,10,(5))

In [2]:
data1

array([6, 5, 3, 3, 7])

In [23]:
# Series 是带有标签的一维数组，可以保存任何数据类型（整数，字符串，浮点数，Python对象等）,轴标签统称为索引
import pandas as pd

s1 = pd.Series(data1,index = ['a','b','c','d','e'])
# 可 from pandas import Series 直接用Series

In [24]:
s1

a    6
b    5
c    3
d    3
e    7
dtype: int32

In [27]:
# Task2  
# 位置索引（切片），不包含尾
s1[2:5]

c    3
d    3
e    7
dtype: int32

In [26]:
# 标签索引收尾包含
s1['c':'e']

c    3
d    3
e    7
dtype: int32

In [29]:
# Task3
data3 = [{'year':2017,'price':10},{'year':2018,'price':20},{'year':2019,'price':30}]
pd.DataFrame(data3, index=list('012'))

   year  price
0  2017     10
1  2018     20
2  2019     30

In [30]:
# Task4
data2 = np.random.randint(5,15,(5,3))
df_test = pd.DataFrame(data2,index = ['a', 'c', 'e', 'f', 'h'],columns =  ['one', 'two', 'three'] )

In [31]:
df_test

   one  two  three
a    6    8      5
c   10    8      6
e    8   11     11
f   11   13     10
h    6    6      9

In [49]:
# Task5
df_test.loc['a','one'] = ''
df_test.loc['c','two'] = -99
df_test.loc['c','three'] = -99
df_test.loc['a','two'] = -100
df_test['four'] = 'test'

In [50]:
df_test

  one  two  three  four
a     -100      5  test
c  10  -99    -99  test
e   8   11     11  test
f  11   13     10  test
h   6    6      9  test

In [51]:
df_change = df_test.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])

In [52]:
df_change

   one    two  three  four
a      -100.0    5.0  test
b  NaN    NaN    NaN   NaN
c   10  -99.0  -99.0  test
d  NaN    NaN    NaN   NaN
e    8   11.0   11.0  test
f   11   13.0   10.0  test
g  NaN    NaN    NaN   NaN
h    6    6.0    9.0  test

In [46]:
# Task6
df_change.dropna()

  one    two  three  four
a     -100.0    5.0  test
c  10  -99.0  -99.0  test
e   8   11.0   11.0  test
f  11   13.0   10.0  test
h   6    6.0    9.0  test

In [54]:
# Task7所有值都为NaN值的行
df_change.dropna(how = 'all')

  one    two  three  four
a     -100.0    5.0  test
c  10  -99.0  -99.0  test
e   8   11.0   11.0  test
f  11   13.0   10.0  test
h   6    6.0    9.0  test

In [55]:
# Task8
df_change.fillna(0)

  one    two  three  four
a     -100.0    5.0  test
b   0    0.0    0.0     0
c  10  -99.0  -99.0  test
d   0    0.0    0.0     0
e   8   11.0   11.0  test
f  11   13.0   10.0  test
g   0    0.0    0.0     0
h   6    6.0    9.0  test

In [56]:
# Task9
df_change.drop_duplicates()

   one    two  three  four
a      -100.0    5.0  test
b  NaN    NaN    NaN   NaN
c   10  -99.0  -99.0  test
e    8   11.0   11.0  test
f   11   13.0   10.0  test
h    6    6.0    9.0  test